//int main(void)
//{
//	// 先乘除后加减
//	printf("%d\n", 4 + 6 % 5);	// 5
//
//	// 两整数相除，结果整数（舍小数部分）
//	printf("%d\n", 19 / 10);	// 1
//
//	// 两浮点数相除，结果 double 浮点数, 默认保留 6 位小数
//	printf("%lf\n", 3.6 / 1.3);	// 2.769231
//
//	// 整数和实数相除，自动类型转换为实型
//	printf("%lf, %llu\n", 6 / 2.0, sizeof(6 / 2.0));  // 表达式结果占 8 字节, double 类型.
//
//	// 除 0 不允许
//	printf("%d\n", 6 / 0);  // 被零除或对零取余 错误.
//
//	// 取余运算,参与运算的操作数,必须为整数
//	printf("%d\n", 7.3 % 2);	// 表达式必须包含整数 错误.
//
//	// 对负数取余，结果为余数的绝对值
//	printf("%d\n", 7 % -5);		// 2
//
//	// 对 0 取余不允许
//	printf("%d\n", 6 % 0);  // 被零除或对零取模 错误.
//
//	return 0;
//}