//#include <stdio.h>
//
//int main()
//
//{
//	// 1：成立  0：不成立
//	// && 与(而且) 两边都为真，结果才为真
//	printf("%d\n", 1 && 1);
//	printf("%d\n", 0 && 0);
//	printf("%d\n", 1 && 0);
//	printf("%d\n", 0 && 1);
//	// || 或(或者) 两边都为假，结果才为假
//	printf("%d\n", 1 || 1);
//	printf("%d\n", 0 || 0);
//	printf("%d\n", 1 || 0);
//	printf("%d\n", 0 || 1);
//	// ！ 非(取反)
//	printf("%d\n", !1);
//	printf("%d\n", !0);
//	printf("-----------------------------");
//
//	// 要求输入两位数的整数，该数字不能包含7，符合要求输出1，不符合要求输出0
//
//	int a;
//	scanf("%d", &a);
//	printf("%d\n",a);
//
//	int gw = a % 10; // 求个位，余数就是个位
//	int sw = a / 10 % 10; // 求十位，余数就是十位
//
//	// 判断
//	printf("%d\n", gw != 7 && sw != 7);
//
//
//
//	// 要求输入两位数的整数，该数字不能包含7，而且不能是7的倍数，符合要求输出1，不符合要求输出0
//	printf("%d\n", gw != 7 && sw != 7 && a % 7 != 0);
//}